
var glitchtexts = [

"s̴̢͇͖̻̯̟͉̬͙̗̯̼̰̹̫̺̏̽͆̊͌͆̃̄̚͜ë̵͚̙̖̝̖̟̤̍̒͂̀̒́̀̄͜͠c̴̡̛̲̟͍̰̪̻̮͉̖̳͈̈́͗̾̀͒͊̆̒̓͊̈́̀̓ͅͅṵ̴̅̇̏͋̎̇̓̂͗̓̇̃̏̍́͌̚ͅr̴͖̞͎͚͈̲̹͕̞̟̜͈̯͇̯͗̀̿̉̌̋̊̊͊̀̈́̉̑̓͌͜ę̷̨̞̹̟͔̰̪̀̊͛͐̍̽̎͆͑?̶̢̻̠̜̪̫̞̠͉͙̤̞̰̘̿́̾͂̽͗̽̅͆͋̈́̊̈́͜͜͝͠?̷̞͔͓̎͌͑͜ͅ",
"s̶̢̺̼̥̹͙̗͇̹͙̬̼̙̳̺̄͛̐͠ͅȩ̶̢̛͔͇̦̫̙̭͓̪̭͋̔̀̇̓͘c̵̢̡̱̭͂̍̇͑͆̽̾̏̾̐̑̄̓̓̚u̴̧̝̠͍͚̤̯͉̱̽̉́̍͂̐̒̂̓̌̽͝r̵̖̻̰̩͇͚̥̓̈́̉͒̅͝ẹ̶͙̬͓͎̘̣̫̓́͐̽̈́̔͂̈́̽̋͂̍̚͝͠?̶̢̢̛̩̞̱͙̳͇̝͙͈̜͚̏̑̓̄̚͜?̸̡̢̹̦͉̪͇̰̎̂͘̕͝?̷̡̢̬͕̦̜͕͈͙͔̖̀͆̌̐̅̏̆̋̋̆̌͐͗͑̐̕͜",
"s̶̨̢̨̯̺̣̣̠̭͍͎̥̝̰̗͐̎̄̌͗̽e̷̼̳̱̔̍̂̒̏̎͆̆̂̐̂̕͝c̴̯͈̱͍̳̫̝͔̖̭͂̂̒̑̉͆̑̅̐̿͐̄͘͝͝ų̵̢̲̦̙̦̳̝̅̍̐̐̈́͌̓̆͋͆ͅr̶̲̪̦̳͑̿̍̃́̌͑͆̊̆̈́̈́̄̿ë̷̡̗̣͖̜̬͊̽̂̃̇̄̈͂̚?̵̬͉͕̥͙͋ ",
"s̴̡̨̪̜̝͚̳̣͓̖̳̦̫͙͔̳̙͂͑̓́͝ȩ̶̳͍̤̖͈͔͓̳̙̫̳͎̈̏̊͒̓͋͜ç̸̫̹͓̳̜͙͍̙̣͗̋͊̽̈́͜ͅų̷̢̹͓̙̙̰͊̿̀̾̑̚͜r̴̡̺̰͇̞͚̺͙̦̹̖̺̖̪͕͍̹̓̇͂͒̍̓̈́̈̊̂̈́͌͑͐̕͝͠e̵̫͇̤̟͎̬̎̿̂̈̔̓͜͝͝͠?̵̨̳̠̼̈̄́̊?̴̖̙͎̳͙̹̭̙̫̘̱͈̗͇̩̤̐̃͝",
"S̸̨̛̯̬̩̺Ĕ̵̺͚̞̳͙͚̘̘̍̋ͅC̶̛̛̞̬̼̯̩͎͉̭̮̔̂̾̔̍́̅̿̀̓͠Ų̴̺̱̪̳͙͖̹͈̪̒̅͂̑̽̒̓͆͌̔͂͜͜͠͠Ř̵̢̭̭͙̲̹͍̻̽͊̋̏̔͗̆͑͒͝E̷͉̖̥̺̐͂̇̇̏̇̎̓̾̆̍͑͌͝",
"̷͍̟̼̒̈́̈́̌̌̐s̴͎̼̣͎̙͎̠͊̍̄̉̎̿̆̂̇̈ͅe̸̡̫̯̪̗̲̹̖̩̤͉̖͐̇̍̀͊̀̏̅̏̑̓̀̎͊͝͝c̸̡͎̻̻̗̩̘̖̯̣̗͊̈̈̄̀̈͊̿͝û̶̧̧̠͎͕̘̟̟̞͕̹͉̼̗̀͌͜ͅr̸̢̡̳̪̺̗̼̹̭̪̓̔͑̋̃͊̚ę̵̧͕̺̋.̴̧̡̩̘̳̦̱̦͇͔̼̱̞̫͎͌̔̎̈́̃͐͊̋̀͊̆̕͜.̴̜̔̽̈́͊͑̎͗̂̉́̀̀̌̚.̶̷̜̳͓̘̫͔͔̹̫̫̉̌̈̇̽̍͊̽̌̉̎̅́́̕",
"s̴̡̝͎͇̳͕̝͚̤̦̀̃͘͜͜ͅḛ̴̱̗̱͎̰͙̮̍͒̑̀̆̂͌̅͗̑͝Ċ̷̛͉̦̹̩̺̪̫̥̰̟̜̼̥̈́͆͂̄̂͑̅̑̚ų̷͚̙͚̣̝̱̣̭͙̩̞̞̮̤͌͒̉̾̎̾̋̂̾͠ͅr̸̡̨̛͉͍͍͍͙̦̘̋͒̃̑͐͋͋͆̽̓̑̈́̈̚͜͝Ȩ̷͔͉͎̗͍͍̦̞̣̪͉̙̙̦̟̊"

];

var i = 0;
function loopingGlitchText()
{
	
	document.getElementById("glitchtext").innerHTML = " Anonymous, fast, and " + glitchtexts[i] + "chat application! ";
	
	i = Math.floor( Math.random() * glitchtexts.length );
	
}

setInterval( loopingGlitchText, 100 );